#include<stdio.h>
#include<math.h>
int main(){
	int a[16][3];			//定义16个参照星，并且将坐标转换成16行3列的二维数组 
	int i,j;				//定义数组的行数和列数方便输入 
	for(i=0;i<16;i++){		//输入参照星的坐标 
		for(j=0;j<3;j++){
			scanf("%d",&a[i][j]); 
		}
	}
	int m,n,s;				//定义目标星 
	while(scanf("%d%d%d",&m,&n,&s)!=EOF){
		if(m==-1&&n==-1&&s==-1)break;//当输入 -1 -1 -1 时停止输入 
		int k,hang;			//定义变量k方便把参照星与目标星的距离储存在一个一维数组b[]中 
		double d,b[16];		//将距离定义为double类型变量计算更精确 
		for(k=0;k<16;k++){	//将距离计算出并储存在数组中 
			d=pow(m-a[k][0],2)+pow(n-a[k][1],2)+pow(s-a[k][2],2);
			b[k]=d;
		}
		int min=b[0];		//找出数组中的最小值和坐标	将每一个目标星与参照星之间的距离都储存起来方便比较计算 
		for(k=0;k<16;k++){
			if(b[k]<min){
				min=b[k];
				hang=k;
			}
		}
		printf("(%d,%d,%d) approach to (%d,%d,%d)\n",m,n,s,a[hang][0],a[hang][1],a[hang][2]);
	}
	return 0;
}
/* 
假设天空中的星是以(x,y,z)为三维空间坐标的。
现在有16颗星作为参照星，
请指出其他星星距离哪一颗星最近。其中(0<=x,y,z<=255)。
0 0 0
255 255 255
0 0 1
1 1 1
128 0 0
0 128 0
128 128 0
0 0 128
126 168 9
35 86 34
133 41 193
128 0 128
0 128 128
128 128 128
255 0 0
0 1 0
0 0 0 
255 255 255
253 254 255
77 79 134
81 218 0
-1 -1 -1*/
